<?php
use frontend\widgets\CityAutoComplete;
use yii\helpers\Html;
use yii\helpers\Url;
?>
<!--<footer class="foot">
    <div class="contain">
        <div class="foot--logo">
            <a href="/"><img src="/media/img/carbax-logo.png" alt=""></a>
            <h4>Все автоуслуги Вашего <span class="orange">города</span></h4>
            <a href="#" class="show_select_region" data-target="#SelectRegion"><span class="foot--city"><?/*= $address['city_name']; */?></span></a>
        </div>
        <div class="foot__sitemap">
            <ul>
                <li>
                    <a href="<?/*= Url::to('/office'); */?>" class="foot__sitemap--parent">Личный кабинет</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/garage'); */?>">Гараж</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/request_type'); */?>">Заявка</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/flea-market/sale_auto'); */?>">Продать авто</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/flea-market/sale_parts'); */?>">Продать запчасти</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/offers'); */?>">Спецпредложения</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/favorites'); */?>">Избранное</a>
                </li>
            </ul>

            <ul>
                <li>
                    <?/*= Html::a('Барахолка',['/flea-market/search'],['class'=>'foot__sitemap--parent']); */?>
                </li>
                <li>
                    <?/*= Html::a('Мототехника',['/flea-market/search','prod_type'=>'2','typeAuto'=>'3']); */?>
                </li>
                <li>
                    <?/*= Html::a('Легковые авто',['/flea-market/search','prod_type'=>'2','typeAuto'=>'1']); */?>
                </li>
                <li>
                    <?/*= Html::a('Грузовые авто',['/flea-market/search','prod_type'=>'2','typeAuto'=>'2']); */?>
                </li>
                <li>
                    <?/*= Html::a('Шины',['/flea-market/search','prod_type'=>'3']); */?>
                </li>
                <li>
                    <?/*= Html::a('Диски',['/flea-market/search','prod_type'=>'4']); */?>
                </li>
            </ul>

            <ul>
                <li>
                    <?/*= Html::a('Запросы',['/request_type'],['class'=>'foot__sitemap--parent']); */?>
                </li>
                <li>
                    <?/*= Html::a('Автошкола',['/request','id'=>'11']); */?>
                </li>
                <li>
                    <?/*= Html::a('Шиномонтаж',['/request','id'=>'1']); */?>
                </li>
                <li>
                    <?/*= Html::a('Автосалон',['/request','id'=>'12']); */?>
                </li>
                <li>
                    <?/*= Html::a('Шины',['/request','id'=>'6']); */?>
                </li>
                <li>
                    <?/*= Html::a('Мойка',['/request','id'=>'2']); */?>
                </li>
                <li>
                    <?/*= Html::a('Тюнинг',['/request','id'=>'8']); */?>
                </li>
                <li>
                    <?/*= Html::a('Запчасти',['/request','id'=>'9']); */?>
                </li>
            </ul>

            <ul>
                <li>
                    <?/*= Html::a('Спецпредложения',['/offers/offers/all_offers','id'=>0],['class'=>'foot__sitemap--parent']); */?>
                <li>
                    <?/*= Html::a('Автосалон',['/offers/offers/all_offers','id'=>'1']); */?>
                </li>
                <li>
                    <?/*= Html::a('Шиномонтаж',['/offers/offers/all_offers','id'=>'2']); */?>
                </li>
                <li>
                    <?/*= Html::a('Шины/Диски',['/offers/offers/all_offers','id'=>'4']); */?>
                </li>
                <li>
                    <?/*= Html::a('Тюнинг',['/offers/offers/all_offers','id'=>'6']); */?>
                </li>
                <li>
                    <?/*= Html::a('Автомойка',['/offers/offers/all_offers','id'=>'10']); */?>
                </li>
                <li>
                    <?/*= Html::a('Автосервис',['/offers/offers/all_offers','id'=>'11']); */?>
                </li>
                <li>
                    <?/*= Html::a('Автомагазин',['/offers/offers/all_offers','id'=>'12']); */?>
                </li>
            </ul>
        </div>
        <div class="foot__sitemap--right">
            <ul>
                <li>
                    <a href="<?/*= Url::to('news'); */?>" class="foot__sitemap--parent">Новости</a>
                </li>

                <?php /*foreach($catNews as $cat):*/?>
                    <li>
                        <a href="<?/*= Url::to(['/news/news/all_news_cat','id'=>$cat->id])*/?>"><?/*= $cat->name; */?></a>
                    </li>
                <?php /*endforeach; */?>

            </ul>
            <ul>
                <li>
                    <a href="<?/*= Url::to(['/static_pages','id'=>'1']);*/?>" class="foot__sitemap--parent">Автопортал</a></li>
                <li>
                    <a href="<?/*= Url::to(['/static_pages','id'=>'1']);*/?>">О нас</a>
                </li>
                <li>
                    <a href="<?/*= Url::to(['/static_pages','id'=>'2']);*/?>">Правила сайта</a>
                </li>
                <li>
                    <a href="<?/*= Url::to(['/site/reklama']);*/?>">Реклама </a>
                </li>
                <li>
                    <a href="<?/*= Url::to(['/static_pages','id'=>'4']);*/?>">Контакты</a>
                </li>
            </ul>

            <ul>
                <li>
                    <a href="<?/*= Url::to('/office');*/?>" class="foot__sitemap--parent">Управление бизнесом</a></li>
                <li>
                    <a href="<?/*= Url::to('/office');*/?>">Личный кабинет</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/select-service');*/?>">Мой бизнес</a>
                </li>
                <li>
                    <a href="<?/*= Url::to('/offers/create');*/?>">Создать спецпредложение</a>
                </li>
            </ul>
            <div class="foot--social">
                <a href="#nowhere"><i class="fa fa-vk"></i></a>
                <a href="#nowhere"><i class="fa fa-facebook"></i></a>
                <a href="#nowhere"><i class="fa fa-twitter"></i></a>
                <a href="#nowhere"><img src="/media/img/lj.png" alt=""></a>
                <a href="#nowhere"><i class="fa fa-odnoklassniki"></i></a>
                <a href="#nowhere"><i class="fa fa-google-plus"></i></a>
            </div>
        </div>
    </div>
</footer>-->

<!-- open .footer -->
<footer class="footer">
    <!-- open .footer__sitemap -->
    <div class="footer__sitemap">
        <ul class="footer__sitemap_list">
            <li><a href="#">Личный кабинет</a></li>
            <li><a href="#">Гараж</a></li>
            <li><a href="#">Заявка</a></li>
            <li><a href="#">Продать авто</a></li>
            <li><a href="#">Продать запчасти</a></li>
            <li><a href="#">Спецпредложения</a></li>
            <li><a href="#">Блокнот</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Барахолка</a></li>
            <li><a href="#">Мототехника</a></li>
            <li><a href="#">Легковые авто</a></li>
            <li><a href="#">Грузовые авто</a></li>
            <li><a href="#">Спецтехника</a></li>
            <li><a href="#">Запчасти</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Запросы</a></li>
            <li><a href="#">Автошкола</a></li>
            <li><a href="#">Шиномонтаж</a></li>
            <li><a href="#">Автосалон</a></li>
            <li><a href="#">Шины/Диски</a></li>
            <li><a href="#">Мойка</a></li>
            <li><a href="#">Тюнинг</a></li>
            <li><a href="#">Запчасти</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Личный кабинет</a></li>
            <li><a href="#">Гараж</a></li>
            <li><a href="#">Заявка</a></li>
            <li><a href="#">Продать авто</a></li>
            <li><a href="#">Продать запчасти</a></li>
            <li><a href="#">Спецпредложения</a></li>
            <li><a href="#">Блокнот</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Новости</a></li>
            <li><a href="#">Новинки на рынке</a></li>
            <li><a href="#">Тюнинг</a></li>
            <li><a href="#">Спорт</a></li>
            <li><a href="#">Самостоятельный ремонт</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Автопортал</a></li>
            <li><a href="#">О нас</a></li>
            <li><a href="#">Правила сайта</a></li>
            <li><a href="#">Реклама </a></li>
            <li><a href="#">Контакты</a></li>
        </ul>
        <ul class="footer__sitemap_list">
            <li><a href="#">Управление бизнесом</a></li>
            <li><a href="#">Личный кабинет</a></li>
            <li><a href="#">Мой бизнес</a></li>
            <li><a href="#">Создать спецпредложение</a></li>
        </ul>

    </div>
    <!-- close .footer__sitemap -->
    <!-- open .footer__social -->
    <ul class="footer__social">
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 548.358 548.358">
                    <path fill="#FFF" d="M545.45 400.298c-.663-1.43-1.282-2.618-1.857-3.57-9.514-17.134-27.695-38.166-54.532-63.1l-.566-.572-.284-.28-.287-.287h-.288c-12.18-11.612-19.893-19.42-23.123-23.416-5.91-7.614-7.234-15.32-4.004-23.13 2.282-5.9 10.854-18.36 25.696-37.397 7.807-10.09 13.99-18.175 18.556-24.267 32.93-43.78 47.208-71.756 42.828-83.94l-1.7-2.846c-1.144-1.714-4.094-3.282-8.847-4.712-4.763-1.427-10.852-1.663-18.277-.712l-82.224.568c-1.333-.472-3.235-.428-5.713.144-2.475.572-3.713.86-3.713.86l-1.43.714-1.137.86c-.952.567-2 1.566-3.142 2.994-1.137 1.423-2.088 3.093-2.848 4.996-8.952 23.03-19.13 44.444-30.553 64.238-7.043 11.803-13.51 22.032-19.418 30.693-5.9 8.658-10.848 15.037-14.842 19.126-4 4.093-7.61 7.372-10.852 9.85-3.237 2.477-5.708 3.524-7.42 3.14-1.714-.382-3.33-.762-4.858-1.142-2.663-1.713-4.805-4.044-6.42-6.994-1.622-2.95-2.714-6.663-3.285-11.136-.57-4.476-.905-8.326-1-11.563-.09-3.233-.05-7.806.144-13.706.198-5.902.287-9.896.287-11.99 0-7.234.142-15.085.425-23.555.288-8.47.52-15.18.716-20.125.195-4.95.285-10.185.285-15.705s-.336-9.85-1-12.99c-.656-3.14-1.663-6.185-2.99-9.138-1.335-2.95-3.29-5.232-5.853-6.852-2.57-1.618-5.763-2.902-9.564-3.856-10.09-2.284-22.936-3.52-38.547-3.71-35.4-.38-58.147 1.905-68.235 6.854-3.997 2.09-7.614 4.948-10.848 8.562-3.427 4.19-3.905 6.475-1.43 6.85 11.42 1.712 19.507 5.805 24.266 12.276l1.715 3.43c1.334 2.473 2.666 6.853 4 13.133 1.33 6.28 2.19 13.227 2.567 20.837.95 13.897.95 25.793 0 35.69-.953 9.9-1.853 17.606-2.712 23.126-.86 5.52-2.143 9.993-3.855 13.418-1.715 3.426-2.856 5.52-3.428 6.28-.57.76-1.047 1.24-1.425 1.427-2.474.948-5.047 1.43-7.71 1.43-2.667 0-5.9-1.333-9.707-4-3.805-2.665-7.754-6.327-11.847-10.99-4.092-4.666-8.708-11.185-13.85-19.56-5.136-8.373-10.466-18.27-15.986-29.69l-4.567-8.282c-2.855-5.327-6.755-13.085-11.704-23.266-4.952-10.185-9.33-20.037-13.134-29.554-1.522-3.997-3.807-7.04-6.852-9.134l-1.43-.86c-.95-.76-2.474-1.566-4.566-2.426-2.095-.86-4.28-1.475-6.567-1.854l-78.23.568c-7.993 0-13.417 1.81-16.273 5.428l-1.143 1.71c-.572.954-.86 2.476-.86 4.57 0 2.095.57 4.665 1.714 7.708 11.42 26.84 23.84 52.725 37.257 77.66 13.42 24.933 25.08 45.018 34.974 60.236 9.897 15.23 19.985 29.602 30.264 43.112 10.28 13.515 17.083 22.176 20.412 25.98 3.333 3.813 5.95 6.663 7.854 8.566l7.14 6.85c4.567 4.57 11.275 10.042 20.126 16.417 8.853 6.38 18.654 12.66 29.408 18.85 10.756 6.182 23.27 11.226 37.546 15.127 14.275 3.905 28.17 5.472 41.684 4.716h32.834c6.66-.575 11.704-2.67 15.133-6.283l1.136-1.43c.765-1.137 1.48-2.902 2.14-5.277.668-2.38 1-5 1-7.85-.195-8.184.428-15.56 1.852-22.125 1.423-6.564 3.045-11.513 4.86-14.846 1.812-3.33 3.858-6.14 6.135-8.418 2.282-2.283 3.908-3.666 4.862-4.142.947-.48 1.704-.804 2.275-1 4.568-1.52 9.944-.047 16.136 4.43 6.188 4.473 11.99 9.996 17.42 16.56 5.424 6.57 11.942 13.94 19.554 22.124 7.617 8.186 14.277 14.27 19.985 18.274l5.707 3.426c3.812 2.286 8.76 4.38 14.853 6.283 6.08 1.9 11.41 2.377 15.984 1.426l73.087-1.14c7.23 0 12.855-1.197 16.845-3.572 3.998-2.38 6.373-5 7.14-7.85.763-2.855.804-6.093.144-9.713-.678-3.61-1.345-6.135-2.01-7.562z"/>
                </svg>
            </a></li>
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 430.113 430.114">
                    <path fill="#FFF" d="M158.08 83.3v59.218h-43.384v72.412h43.385v215.183h89.123V214.936h59.805s5.6-34.72 8.316-72.685H247.54V92.74c0-7.4 9.717-17.354 19.32-17.354h48.558V0h-66.02c-93.52-.004-91.317 72.48-91.317 83.3z"/>
                </svg>
            </a></li>
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 612 612">
                    <path fill="#FFF" d="M612 116.258c-22.525 9.98-46.694 16.75-72.088 19.772 25.93-15.527 45.777-40.155 55.184-69.41-24.322 14.378-51.17 24.82-79.775 30.48-22.906-24.438-55.49-39.66-91.63-39.66-69.333 0-125.55 56.218-125.55 125.514 0 9.828 1.11 19.427 3.25 28.606-104.325-5.24-196.834-55.223-258.75-131.174-10.822 18.51-16.98 40.078-16.98 63.1 0 43.56 22.182 81.994 55.836 104.48-20.575-.688-39.926-6.348-56.867-15.756v1.568c0 60.806 43.29 111.554 100.692 123.104-10.517 2.83-21.607 4.398-33.08 4.398-8.107 0-15.947-.803-23.634-2.333 15.985 49.907 62.336 86.2 117.253 87.194-42.946 33.655-97.098 53.656-155.915 53.656-10.134 0-20.116-.612-29.944-1.72 55.568 35.68 121.537 56.484 192.44 56.484 230.947 0 357.187-191.29 357.187-357.188l-.42-16.253C573.87 163.525 595.21 141.42 612 116.257z"/>
                </svg>
            </a></li>
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 304.999 304.999">
                    <g fill="#FFF">
                        <path d="M160.662 19.47c-18.934 0-37.323 3.668-54.693 10.88L76.352.733c-.82-.82-2.094-.967-3.082-.36C44.437 18.203 19.774 42.866 1.948 71.7c-.61.985-.462 2.26.358 3.08l28.39 28.384c-8.49 18.637-12.808 38.5-12.808 59.074 0 78.72 64.05 142.762 142.775 142.762 78.72 0 142.765-64.043 142.765-142.762 0-78.723-64.044-142.768-142.765-142.768zm56.563 129.194l9.943 42.082 9.543 44.395-44.336-9.532-42.055-9.893L36.71 102.11c14.252-29.337 38.34-52.618 68.114-65.83l112.4 112.384z"/>
                        <path d="M221.76 187.396l-7.522-33.023c-25.89 11.89-46.404 32.402-58.283 58.295l33.023 7.52c7.01-14.023 18.77-25.778 32.782-32.792z"/>
                    </g>
                </svg>
            </a></li>
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 95.481 95.481">
                    <g fill="#FFF">
                        <path d="M43.04 67.254c-7.4-.772-14.075-2.595-19.79-7.064-.708-.556-1.44-1.092-2.087-1.713-2.5-2.402-2.753-5.153-.774-7.988 1.692-2.427 4.534-3.076 7.488-1.683.572.27 1.117.607 1.64.97 10.648 7.316 25.277 7.518 35.966.328 1.06-.812 2.19-1.474 3.503-1.812 2.55-.655 4.93.282 6.3 2.514 1.563 2.55 1.543 5.037-.384 7.016-2.956 3.034-6.51 5.23-10.46 6.76-3.736 1.45-7.827 2.178-11.876 2.662.61.665.9.992 1.28 1.376 5.5 5.525 11.02 11.026 16.5 16.567 1.868 1.888 2.258 4.23 1.23 6.425-1.124 2.4-3.64 3.98-6.107 3.81-1.563-.108-2.782-.886-3.865-1.977-4.15-4.175-8.376-8.273-12.44-12.527-1.184-1.237-1.753-1.003-2.797.07-4.174 4.298-8.416 8.53-12.683 12.736-1.916 1.89-4.196 2.23-6.418 1.15-2.362-1.145-3.865-3.556-3.75-5.98.08-1.638.887-2.89 2.012-4.013C30.97 79.45 36.395 74 41.823 68.56c.36-.363.694-.747 1.217-1.306z"/>
                        <path d="M47.55 48.33c-13.205-.046-24.033-10.993-23.956-24.22C23.67 10.74 34.504-.036 47.84 0c13.362.036 24.087 10.967 24.02 24.478-.068 13.2-10.97 23.897-24.31 23.85zm12-24.187c-.022-6.567-5.252-11.795-11.806-11.8-6.61-.008-11.886 5.315-11.835 11.942.048 6.542 5.323 11.733 11.895 11.71 6.552-.024 11.768-5.286 11.746-11.852z"/>
                    </g>
                </svg>
            </a></li>
        <li><a href="#">
                <svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 491.858 491.858">
                    <g fill="#FFF">
                        <path d="M377.472 224.957H201.32v58.718h107.47c-16.032 51.048-63.714 88.077-120.055 88.077-69.492 0-125.823-56.335-125.823-125.824 0-69.492 56.333-125.823 125.823-125.823 34.994 0 66.645 14.29 89.452 37.346l42.622-46.327c-34.04-33.355-80.65-53.93-132.075-53.93C84.5 57.194 0 141.694 0 245.93s84.5 188.737 188.736 188.737c91.307 0 171.248-64.844 188.737-150.99V224.96zM491.858 224.857h-36.03v-36.03H424.94v36.03h-36.03v30.883h36.03v36.032h30.887V255.74h36.03"/>
                    </g>
                </svg>
            </a></li>
    </ul>
    <!-- close .footer__social -->
</footer>
<!-- close .footer -->

<!--<div class="modal fade" id="SelectRegion" >
    <div class="modal-dialog modal-dialog-center">
        <div class="modal-content">
            <div class="modal-header">
                <button type="button" class="close" data-dismiss="modal" aria-hidden="true">&times;</button>
                <h4 class="modal-title" id="myModalLabel">Выбор города <span class="orange">Carbax.ru</span></h4>
            </div>
            <div class="modal-body">
                <?php /*$address = \common\classes\Address::get_geo_info();
                */?>

                <div><span>Вы находитесь: <span class="orange"><?/*= $address['region_name'] */?>  <?/*= $address['city_name'] */?></span></span></div>
                <div class="orange">Для изменения введите город</div>
                <form action="<?/*=$_SERVER['REQUEST_URI']*/?>" class="modal--region" id="auto_complete_form" method="post">
                    <?/*= \frontend\widgets\CityAutoCompleteModal::widget(); */?>
                    <?/*= \frontend\widgets\GetGeoInfo::widget(); */?>
                    <input type="hidden" name="_csrf" value="<?/*= Yii::$app->request->getCsrfToken(); */?>">

                </form>

            </div>

        </div>
    </div>
</div>-->